//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：TDengineVersion.cs
// 项目名称：TDengine RESTful API 连接器
// 创建时间：2022-08-22 22:24:50
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.DBUtility.TDengine;

/// <summary>
/// 版本选择器枚举
/// </summary>
public enum TDengineVersion : byte
{
    /// <summary>
    /// TDengine 2.x
    /// </summary>
    V2 = 2,

    /// <summary>
    /// TDengine 3.x
    /// </summary>
    V3 = 3,
}