//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：GuidFormatType.cs
// 项目名称：魂哥常用工具集
// 创建时间：2023-02-20 11:17:21
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.CommonUtility.Entity;

/// <summary>
/// GUID 格式化类型
/// </summary>
public enum GuidFormatType
{
    /// <summary>
    /// 由32位连续字符构成
    /// </summary>
    /// <remarks>示例：00000000000000000000000000000000</remarks>
    N,

    /// <summary>
    /// 由32位字符和间隔符共同构成
    /// </summary>
    /// <remarks>示例：00000000-0000-0000-0000-000000000000</remarks>
    D,

    /// <summary>
    /// 由32位字符、间隔符、大括号共同构成
    /// </summary>
    /// <remarks>示例：{00000000-0000-0000-0000-000000000000}</remarks>
    B,

    /// <summary>
    /// 由32位字符、间隔符、括号共同构成
    /// </summary>
    /// <remarks>示例：(00000000-0000-0000-0000-000000000000)</remarks>
    P,

    /// <summary>
    /// 由四个十六进制值括在大括号中，其中第四个值是八个十六进制值的子集，也用大括号括起来。
    /// </summary>
    /// <remarks>示例：{0x00000000，0x0000，0x0000，{0x00，0x00，0x00，0x00，0x00，0x00，0x00，0x00}}</remarks>
    X
}