Dawn.RegularTips = {
    Selector: {
        "tips": "请从下拉框选择",
        "warn": "对不起！您的选择不正确或还未选择",
        "error": "对不起！您选择的内容已存在"
    },
    IsEmpty: {
        "tips": "请输入相应的内容",
        "warn": "对不起！请输入相应的内容",
        "error": "对不起！您输入的内容已存在"
    },
    /*----------------------------------------------------------
    ----    电子邮件
    ----------------------------------------------------------*/
    IsEmail: {
        "tips": "请输入常用电子邮箱",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！电子邮箱已被使用"
    },
    IsEmailValid: {
        "tips": "请输入常用电子邮箱",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！电子邮箱已被使用"
    },
    /*----------------------------------------------------------
    ----    中文验证
    ----------------------------------------------------------*/
    ChsIsTname: {
        "tips": "请输入真实姓名，2-4个汉字",
        "warn": "对不起！您输入的格式不正确，2-4个汉字",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsChinese: {
        "tips": "请输入中文，简体中文",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsChineseOrEngOrNum: {
        "tips": "请输入中文、英文、数字",
        "warn": "格式不正确！中文、英文、数字",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsChineseOrEngOrNums: {
        "tips": "请输入中文、英文、数字，中文或英文开头",
        "warn": "格式不正确！中文、英文、数字，中文或英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsText: {
        "tips": "请输入中文、英文、数字，符号：《》()[]（）",
        "warn": "格式不正确！中文、英文、数字，符号：《》()[]（）",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsTexts: {
        "tips": "请输入中文、英文、数字，符号：《》()[]（），中文或英文开头",
        "warn": "格式不正确！中文、英文、数字，符号：《》()[]（），中文或英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsMemo: {
        "tips": "请输入中文、英文、数字，符号：《》()[]（）：:、，,。.；;！!……",
        "warn": "格式不正确！中文、英文、数字，符号：《》()[]（）：:、，,。.；;！!……",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsMemos: {
        "tips": "请输入中文、英文、数字，符号：《》()[]（）：:、，,。.；;！!……，中文或英文开头",
        "warn": "格式不正确！中文、英文、数字，符号：《》()[]（）：:、，,。.；;！!……，中文或英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    ChsIsAddress: {
        "tips": "请输入中文、英文、数字，符号：《》()[-]（、）",
        "warn": "格式不正确！中文、英文、数字，符号：《》()[-]（、）",
        "error": "对不起！您输入的内容已存在"
    },
    /*----------------------------------------------------------
    ----    英文验证
    ----------------------------------------------------------*/
    EngIsPwd: {
        "tips": "请输入由任意字符组成的密码，长度：6-16 [区分大小写]",
        "warn": "格式不正确！长度：6-16 [区分大小写]",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsPassword: {
        "tips": "请输入由任意字符组成的密码，长度：6-16 [区分大小写]，英文开头",
        "warn": "格式不正确！长度：6-16 [区分大小写]，英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsPasswords: {
        "tips": "请输入由英文和数字及下划线组成的密码，长度：6-16 [区分大小写]，英文开头",
        "warn": "格式不正确！长度：6-16 [区分大小写]，英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsRegister: {
        "tips": "请输入由英文和数字组成的注册帐号，长度：4-8 [不区分大小写]，英文开头",
        "warn": "格式不正确！长度：4-8 [不区分大小写]，英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsRegisters: {
        "tips": "请输入由英文和数字组成的注册帐号，长度：4-16 [不区分大小写]，英文开头",
        "warn": "格式不正确！长度：4-16 [不区分大小写]，英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsEnglish: {
        "tips": "请输入由26个英文字母组成的数据，不区分大小写",
        "warn": "格式不正确！26个英文字母，不区分大小写",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsUppercase: {
        "tips": "请输入由26个英文大写字母组成的数据",
        "warn": "格式不正确！26个英文大写字母",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsLowercase: {
        "tips": "请输入由26个英文小写字母组成的数据",
        "warn": "格式不正确！26个英文小写字母",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsEngAndNum: {
        "tips": "请输入由26个英文和数字组成的数据",
        "warn": "格式不正确！26个英文和数字",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsEngAndNums: {
        "tips": "请输入由26个英文和数字组成的数据，英文开头",
        "warn": "格式不正确！26个英文和数字，英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsEngAndNumComma: {
        "tips": "请输入由26个英文和数字及逗号组成的数据，英文开头",
        "warn": "格式不正确！26个英文和数字及逗号，英文开头",
        "error": "对不起！您输入的内容已存在"
    },
    EngIsEngAndNumOrUnderline: {
        "tips": "请输入由26个英文和数字及下划线组成的数据",
        "warn": "格式不正确！26个英文和数字及下划线",
        "error": "对不起！您输入的内容已存在"
    },
    /*----------------------------------------------------------
    ----    数字验证
    ----------------------------------------------------------*/
    NumIsByteTinyint: {
        "tips": "请输入由0-255组成的整数",
        "warn": "对不起！您输入的格式不正确，0-255",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsInteger: {
        "tips": "请输入由数字组成的数据，0-9",
        "warn": "对不起！您输入的格式不正确，0-9",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsZeroOrNot: {
        "tips": "请输入由零或非零开头组成的数字",
        "warn": "格式不正确！由零或非零开头组成",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsPlus2Point: {
        "tips": "请输入由2位小数组成的正实数",
        "warn": "格式不正确！由2位小数组成的正实数",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsPlus3Point: {
        "tips": "请输入由1至3位小数组成的正实数",
        "warn": "格式不正确！由1至3位小数组成的正实数",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsIntegralBySignless: {
        "tips": "请输入为非零的正整数",
        "warn": "对不起！您输入的格式不正确。非零的正整数",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsIntegralByNegative: {
        "tips": "请输入为非零的负整数",
        "warn": "对不起！您输入的格式不正确。非零的负整数",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsFloatBySignless: {
        "tips": "请输入为正浮点数的数据",
        "warn": "对不起！您输入的格式不正确。正浮点数",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsFloatByNegative: {
        "tips": "请输入为负浮点数的数据",
        "warn": "对不起！您输入的格式不正确。负浮点数",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsDouble: {
        "tips": "请输入为双精度类型的数据",
        "warn": "对不起！您输入的格式不正确。双精度类型的数据",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsDoubles: {
        "tips": "请输入为双精度类型的数据，包含正负号",
        "warn": "对不起！您输入的格式不正确。双精度，包含正负号",
        "error": "对不起！您输入的内容已存在"
    },
    NumIsMoney: {
        "tips": "请输入为Money类型的数据",
        "warn": "对不起！您输入的格式不正确。Money类型",
        "error": "对不起！您输入的内容已存在"
    },
    /*----------------------------------------------------------
    ----    电话号码
    ----------------------------------------------------------*/
    TelIsAnyPhone: {
    	"tips": "请输入符合电话号码或手机号码格式的数据",
    	"warn": "对不起！您输入的电话号码或手机号码不正确",
    	"error": "对不起！您输入的内容已存在"
    },
    TelIsAllPhone: {
    	"tips": "请输入联系电话，座机或手机，座机用“-”隔开",
    	"warn": "对不起！您输入的联系电话格式不正确",
    	"error": "对不起！您输入的内容已存在"
    },
    TelIsTelephoneAny: {
    	"tips": "请输入符合电话号码格式的数据",
    	"warn": "对不起！您输入的电话号码不正确",
    	"error": "对不起！您输入的内容已存在"
    },
    TelIsTelephone: {
    	"tips": "请输入符合电话号码格式的数据，010-88888888，区号3-4位，号码7-8位",
    	"warn": "格式不正确！，010-88888888，区号3-4位，号码7-8位",
    	"error": "对不起！您输入的内容已存在"
    },
    TelIsMobile: {
    	"tips": "请输入符合手机号码格式的数据",
    	"warn": "对不起！您输入的手机号码不正确",
    	"error": "对不起！您输入的内容已存在"
    },
    TelIsMobileAny: {
    	"tips": "请输入符合手机号码格式的数据",
    	"warn": "对不起！您输入的手机号码不正确",
    	"error": "对不起！您输入的内容已存在"
    },
    TelIsChinaMobile: {
        "tips": "请输入符合中国移动的手机号码格式的数据",
        "warn": "对不起！您输入的移动手机号码不正确",
        "error": "对不起！您输入的内容已存在"
    },
    TelIsChinaUnicom: {
        "tips": "请输入符合中国联通的手机号码格式的数据",
        "warn": "对不起！您输入的联通手机号码不正确",
        "error": "对不起！您输入的内容已存在"
    },
    TelIsChinaTelecom: {
        "tips": "请输入符合中国电信的手机号码格式的数据",
        "warn": "对不起！您输入的电信手机号码不正确",
        "error": "对不起！您输入的内容已存在"
    },
    /*----------------------------------------------------------
    ----    IP 地址
    ----------------------------------------------------------*/
    IsIP: {
        "tips": "请输入IP地址格式的数据",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！您输入的内容已存在"
    },
    IsIPs: {
        "tips": "请输入IP地址格式的数据",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！您输入的内容已存在"
    },
    IsIPSect: {
        "tips": "请输入IP地址格式的数据",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！您输入的内容已存在"
    },
    /*----------------------------------------------------------
    ----    常规验证
    ----------------------------------------------------------*/
    IdCard: {
        "tips": "请输入符合中国公民身份证规范的数据",
        "warn": "格式不正确！须符合中国公民身份证规范",
        "error": "对不起！您输入的内容已存在"
    },
    IsURL: {
        "tips": "请输入正确的URL地址格式数据",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！您输入的内容已存在"
    },
    IsPost: {
        "tips": "请输入符合邮政编码格式的数据",
        "warn": "格式不正确！6位数字的邮政编码",
        "error": "对不起！您输入的内容已存在"
    },
    UnSafe: {
        "tips": "请输入符合安全标准的数据",
        "warn": "对不起！您输入的格式不正确",
        "error": "对不起！您输入的内容已存在"
    },
    IsPer: {
        "tips": "请输入符合百分比的数据",
        "warn": "格式不正确！百分比数据",
        "error": "对不起！您输入的内容已存在"
    },
    IsDate: {
        "tips": "请输入符合日期格式标准的数据，例：2012-12-21",
        "warn": "格式不正确！日期格式，例：2012-12-21",
        "error": "对不起！您输入的内容已存在"
    }
}