//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：ThumbnailsMode.cs
// 项目名称：文件操作实用工具集
// 创建时间：2023-05-26 22:56:38
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.FileUtility.Entity;

/// <summary>
/// 缩略图生成模式枚举
/// </summary>
public enum ThumbnailsMode
{
    /// <summary>
    /// 直接按指定高度和宽度 (可能变形)
    /// </summary>
    HW,

    /// <summary>
    /// 按指定宽度，高度按比例自动缩放。
    /// </summary>
    W,

    /// <summary>
    /// 按指定高度，宽度按比例自动缩放。
    /// </summary>
    H,

    /// <summary>
    /// 按指定高度和宽度进行裁减 (不变形)
    /// </summary>
    Cut
}