//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：WatermarkLocation.cs
// 项目名称：文件操作实用工具集
// 创建时间：2023-05-28 11:09:37
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.FileUtility.Entity;

/// <summary>
/// 水印位置枚举
/// </summary>
public enum WatermarkLocation
{
    /// <summary>
    /// 左上角
    /// </summary>
    LT,

    /// <summary>
    /// 上居中
    /// </summary>
    T,

    /// <summary>
    /// 右上角
    /// </summary>
    RT,

    /// <summary>
    /// 左居中
    /// </summary>
    LC,

    /// <summary>
    /// 居中
    /// </summary>
    C,

    /// <summary>
    /// 右居中
    /// </summary>
    RC,

    /// <summary>
    /// 左下角
    /// </summary>
    LB,

    /// <summary>
    /// 下居中
    /// </summary>
    B,

    /// <summary>
    /// 右下角
    /// </summary>
    RB
}