//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：DecryptionOptions.cs
// 项目名称：加解密集约工具集
// 创建时间：2023-06-03 15:17:19
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.PasswordUtility;

/// <summary>
/// 解密集约选项参数基类
/// </summary>
public abstract class DecryptionOptions
{
    /// <summary>
    /// 需要解密的源字符串
    /// </summary>
    public string SourceString { get; set; } = string.Empty;
}