//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：PasswordType.cs
// 项目名称：魂哥常用工具集
// 创建时间：2023-02-20 14:18:16
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.PasswordUtility;

/// <summary>
/// 加解密集约类型枚举
/// </summary>
public enum PasswordType
{
    /// <summary>
    /// SHA512
    /// </summary>
    SHA512,
        
    //Hash计算、md5计算、sha1计算、sha256计算、sha512计算、AES加密、DES加密、RC4加密、Rabbit加密、TripleDes加密
}