//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：CustomUI.cs
// 项目名称：魂哥常用工具集
// 创建时间：2022-10-31 21:17:27
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.PagingUtility.Internal;

/// <summary>
/// 基于自定义样式构建的数据分页
/// </summary>
internal static class CustomUI
{
    /// <summary>
    /// 创建数据分页
    /// </summary>
    /// <param name="options">数据分页选项(参数)</param>
    /// <returns>数据分页</returns>
    public static string Create(PagingOptions options)
    {
        return string.Empty;
    }
}