//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：PictureFormat.cs
// 项目名称：图像辅助与应用工具集
// 创建时间：2023-12-11 14:04:40
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.PictureUtility;

/// <summary>
/// 图像格式
/// </summary>
public enum PictureFormat
{
    /// <summary>
    /// 联合图像专家组（JPEG）图像格式
    /// </summary>
    JPEG,

    /// <summary>
    /// 位图（BMP）图像格式
    /// </summary>
    BMP,

    /// <summary>
    /// W3C 便携式网络图形（PNG）图像格式
    /// </summary>
    PNG,

    /// <summary>
    /// 图形交换格式 (GIF) 图像格式
    /// </summary>
    GIF,

    /// <summary>
    /// 二进制图像文件格式
    /// </summary>
    /// <remarks>用于存储黑白（1位）图像</remarks>
    PBM,

    /// <summary>
    /// Quite OK Image Format (相当棒的图像格式)
    /// </summary>
    QOI,

    /// <summary>
    /// 计算机图像文件格式
    /// </summary>
    TGA,

    /// <summary>
    /// 标记图像文件格式（TIFF）图像格式
    /// </summary>
    TIFF,

    /// <summary>
    /// WebP 图像格式
    /// </summary>
    WebP
}