//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：ITDengineTableManage.cs
// 项目名称：TDengine 数据库管理
// 创建时间：2022-07-25 13:53:25
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.DBUtility.TDengine.Managed;

/// <summary>
/// TDengine 数据表管理接口
/// </summary>
public interface ITDengineTableManage
{

    Task CreateTableAsync(TableCreateOption option);


    Task DropTableAsync(string dbName, string tbName);
}