//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：LeadTimeType.cs
// 项目名称：自动删除文件工具
// 创建时间：2023-11-10 16:28:10
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.AutomaticDeletionFiles.Entity;

/// <summary>
/// 前置时间单位枚举类
/// </summary>
public enum LeadTimeType
{
    /// <summary>
    /// 日
    /// </summary>
    Day,

    /// <summary>
    /// 小时
    /// </summary>
    Hour,

    /// <summary>
    /// 分钟
    /// </summary>
    Minute,

    /// <summary>
    /// 秒
    /// </summary>
    Second
}