//=========================================================================
//**   魂哥常用工具集（GSA.MOLLE.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2014 -- Support 文雀
//=========================================================================
// 文件名称：PagerType.cs
// 项目名称：数据分页展示工具集
// 创建时间：2010-11-09
// 创建人员：宋杰军
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
using System;

namespace ToolKits.PagerUtility
{
    /// <summary>
    /// 数据分页模式
    /// </summary>
    public enum PagerType
    {
        /// <summary>
        /// Ajax模式，Json数据模式
        /// </summary>
        Ajax,
        /// <summary>
        /// MVC 模式，Json数据模式
        /// </summary>
        Mvc,
        /// <summary>
        /// URL 链接传参，URL必须静态化
        /// </summary>
        Url,
        /// <summary>
        /// 自定义前端函数模式
        /// <para>未使用</para>
        /// </summary>
        Custom,
        /// <summary>
        /// 无分页模式
        /// </summary>
        None
    }
}
