//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：EMQTelemetryStatusModel.cs
// 项目名称：EMQX消息服务工具集
// 创建时间：2023-03-19 20:25:38
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace GSA.ToolKits.EMQXUtility.Entity;

/// <summary>
/// EMQX遥测状态实体类
/// </summary>
[Serializable]
public sealed class EMQTelemetryStatusModel
{
    /// <summary>
    /// 是否遥测启用
    /// </summary>
    /// <remarks>true 启用 / false 禁用</remarks>
    [JsonPropertyName("enable")]
    public bool Enable { get; set; }
}