//=========================================================================
//**   魂哥常用工具集（CRS.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2023 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：GlobalUsingDefinition.cs
// 项目名称：我是一个负责全局引用的类，没有其它功能。
// 创建时间：2023-02-23 17:14:53
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
global using GSA.ToolKits.EMQXUtility.Entity;
global using RestSharp;
global using RestSharp.Authenticators;
global using System.Text.Json;
global using System.Text.Json.Serialization;