//=========================================================================
//**   魂哥常用工具集（GSA.MOLLE.ToolKits）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2014 -- Support 文雀
//=========================================================================
// 文件名称：LogType.cs
// 项目名称：文件操作实用工具集
// 创建时间：2014年2月20日16时29分
// 创建人员：宋杰军
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
using System;

namespace ToolKits.FileUtility
{
    /// <summary> 
    /// 日志类型类
    /// </summary> 
    /// <remarks>每日或每周或每月或每年创建的日志</remarks> 
    public enum LogType
    {
        /// <summary>
        /// 按小时创建日志
        /// </summary>
        Hour,
        /// <summary> 
        /// 通过每日创建日志
        /// </summary> 
        Daily,
        /// <summary> 
        /// 按每月创建日志
        /// </summary> 
        Monthly,
        /// <summary> 
        /// 创建日志由每年
        /// </summary> 
        Annually
    }
}
