//==================================================================== 
//*****                     晨曦小竹常用工具集                   *****
//====================================================================
//**   Copyright © DawnXZ.com 2014 -- QQ：6808240 -- 请保留此注释   **
//====================================================================
// 文件名称：ValidateType.cs
// 项目名称：数据校验实用工具集
// 创建时间：2014-03-24 14:47:31
// 创建人员：宋杰军
// 负 责 人：宋杰军
// 参与人员：宋杰军
// ===================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ===================================================================
using System;

namespace DawnXZ.VerifyUtility
{
    /// <summary>
    /// 验证类型
    /// </summary>
    [Flags]
    public enum ValidateType
    {
        /// <summary>
        /// 字段或属性是否为空字串
        /// </summary>
        IsEmpty = 0x0001,
        /// <summary>
        /// 字段或属性的最小长度
        /// </summary>
        MinLength = 0x0002,
        /// <summary>
        /// 字段或属性的最大长度
        /// </summary>
        MaxLength = 0x0004,
        /// <summary>
        /// 字段或属性的值是否为数值型
        /// </summary>
        IsNumber = 0x0008,
        /// <summary>
        /// 字段或属性的值是否为时间类型
        /// </summary>
        IsDateTime = 0x0010,
        /// <summary>
        /// 字段或属性的值是否为正确的浮点类型
        /// </summary>
        IsDecimal = 0x0020,
        /// <summary>
        /// 字段或属性的值是否包含在指定的数据源数组中
        /// </summary>
        IsInCustomArray = 0x0040,
        /// <summary>
        /// 字段或属性的值是否为固定电话号码格式
        /// </summary>
        IsTelphone = 0x0080,
        /// <summary>
        /// 字段或属性的值是否为手机号码格式
        /// </summary>
        IsMobile = 0x0100
    }
}
